eisup_2019_docmng_integration/src/DataProcessors/ОбработкаОтрицательногоОставшегосяСрокаИспользованияМСФО/ОбработкаОтрицательногоОставшегосяСрокаИспользованияМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработкаОтрицательногоОставшегосяСрокаИспользованияМСФО</name>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentObject.ПоступлениеОсновныхСредствМеждународный</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

eisup_2019_docmng_integration/src/InformationRegisters/ОсновныеСредстваМеждународныйУчет/ОсновныеСредстваМеждународныйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОсновныеСредстваМеждународныйУчет</name>
  <comment>(Упр) Сведения об объектах ОС  для целей международного учета</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <comment>Организация, на балансе которой учитывется объект ОС в международном учете</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПринятияКУчету</name>
    <comment>Дата принятия объекта к международному учету</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>МестонахождениеОбъекта</name>
    <comment>Подразделение организации, в котором находится объект ОС</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.ВидыСостоянийОС</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчета</name>
    <comment>Счет учета в плане счетов Международный</comment>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>СрокПолезногоИспользования</name>
    <comment>Срок полезного использования в месяцах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НачислятьАмортизацию</name>
    <comment>Булево - начиляется амортизация или нет</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МетодНачисленияАмортизации</name>
    <comment>Метод начисления амортизации по международному учету</comment>
    <type>
      <types>EnumRef.МетодыНачисленияАмортизацииОСМеждународный</types>
    </type>
  </resources>
  <resources>
    <name>СчетНачисленияАмортизации</name>
    <comment>Счет, на котором накапливается начисленная амортизация</comment>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимость</name>
    <comment>Первоначальная (историческая) стоимость объекта</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СправедливаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛиквидационнаяСтоимость</name>
    <comment>Стоимость, которая должна остаться после истечения срока полезного использования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетЗатрат</name>
    <comment>Счет учета, в дебет которого относятся амортизационные отчисления</comment>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>Субконто1</name>
    <comment>Субконто первого уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто2</name>
    <comment>Субконто второго уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто3</name>
    <comment>Субконто третьего уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>ПредполагаемыйОбъемПродукции</name>
    <comment>Используется при амортизации пропорционально объему продукции</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНачисленнойАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УбытокОтОбесценения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентУскорения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетСниженияСтоимости</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/УчетнаяПолитикаМеждународныйУчет/УчетнаяПолитикаМеждународныйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаМеждународныйУчет</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>МетодРасчетаДанныхВновьПриобретенныхКомпаний</name>
    <type>
      <types>EnumRef.МетодыРасчетаДанныхВновьПриобретенныхКомпаний</types>
    </type>
  </resources>
  <resources>
    <name>МетодУчетаИнвестиционнойСобственности</name>
    <type>
      <types>EnumRef.МетодыОценкиАктивов</types>
    </type>
  </resources>
  <resources>
    <name>МетодАмортизацииНМА</name>
    <type>
      <types>EnumRef.СпособыНачисленияАмортизацииНМА</types>
    </type>
  </resources>
  <resources>
    <name>МетодОпределенияПроцентаВыполненияДоговораПодряда</name>
    <type>
      <types>EnumRef.МетодыОпределенияПроцентаВыполненияДоговораПодряда</types>
    </type>
  </resources>
  <resources>
    <name>СпособОценкиМПЗ</name>
    <type>
      <types>EnumRef.СпособыОценки</types>
    </type>
  </resources>
  <resources>
    <name>МетодОценкиОсновныхСредств</name>
    <type>
      <types>EnumRef.МетодыОценкиАктивов</types>
    </type>
  </resources>
  <resources>
    <name>МетодПереоценкиОС</name>
    <type>
      <types>EnumRef.МетодыПереоценкиОС</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Documents/ПоступлениеОсновныхСредствМеждународный/ПоступлениеОсновныхСредствМеждународный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеОсновныхСредствМеждународный</name>
  <comment>(Упр)</comment>
  <registerRecords>InformationRegister.ОсновныеСредстваМеждународныйУчет</registerRecords>
  <registerRecords>AccumulationRegister.абс_СтоимостьОСМеждународный</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодНачало</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодКонец</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>МестонахождениеОбъекта</name>
      <comment>Подразделение организации, в котором находится объект ОС</comment>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>МОЛ</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <comment>Счет учета в плане счетов Международный</comment>
      <type>
        <types>ChartOfAccountsRef.Международный</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокПолезногоИспользования</name>
      <comment>Срок полезного использования в месяцах</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачислятьАмортизацию</name>
      <comment>Булево - начисляется амортизация или нет</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МетодНачисленияАмортизации</name>
      <comment>Метод начисления амортизации по международному учету</comment>
      <type>
        <types>EnumRef.МетодыНачисленияАмортизацииОСМеждународный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетНачисленияАмортизации</name>
      <comment>Счет, на котором накапливается начисленная амортизация</comment>
      <type>
        <types>ChartOfAccountsRef.Международный</types>
      </type>
    </attributes>
    <attributes>
      <name>ПервоначальнаяСтоимость</name>
      <comment>Первоначальная (историческая) стоимость объекта</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛиквидационнаяСтоимость</name>
      <comment>Стоимость, которая должна остаться после истечения срока полезного использования</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <comment>Счет учета, в дебет которого относятся амортизационные отчисления</comment>
      <type>
        <types>ChartOfAccountsRef.Международный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <comment>Субконто первого уровня счета, в дебет которого относится амортизация</comment>
      <type>
        <types>Characteristic.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <comment>Субконто второго уровня счета, в дебет которого относится амортизация</comment>
      <type>
        <types>Characteristic.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <comment>Субконто третьего уровня счета, в дебет которого относится амортизация</comment>
      <type>
        <types>Characteristic.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредполагаемыйОбъемПродукции</name>
      <comment>Используется при амортизации пропорционально объему продукции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНачисленнойАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчитыватьКакОС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПринятияКУчету</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаНовый</name>
      <comment>Счет учета в плане счетов Международный</comment>
      <type>
        <types>ChartOfAccountsRef.Международный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1Нов</name>
      <comment>Субконто первого уровня счета, в дебет которого относится амортизация</comment>
      <type>
        <types>Characteristic.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2Нов</name>
      <comment>Субконто второго уровня счета, в дебет которого относится амортизация</comment>
      <type>
        <types>Characteristic.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3Нов</name>
      <comment>Субконто третьего уровня счета, в дебет которого относится амортизация</comment>
      <type>
        <types>Characteristic.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентУскорения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетСниженияСтоимости</name>
      <type>
        <types>ChartOfAccountsRef.Международный</types>
      </type>
    </attributes>
    <attributes>
      <name>КоррСчет</name>
      <type>
        <types>ChartOfAccountsRef.Международный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1Кт</name>
      <comment>Субконто первого уровня счета, в дебет которого относится амортизация</comment>
      <type>
        <types>Characteristic.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2Кт</name>
      <comment>Субконто второго уровня счета, в дебет которого относится амортизация</comment>
      <type>
        <types>Characteristic.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3Кт</name>
      <comment>Субконто третьего уровня счета, в дебет которого относится амортизация</comment>
      <type>
        <types>Characteristic.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/DataProcessors/ОбработкаОтрицательногоОставшегосяСрокаИспользованияМСФО/ObjectModule.bsl
Процедура Обработать() Экспорт
	Счета = ПланыСчетов.Международный;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	               |	СписокОС.МетодНачисленияАмортизации КАК МетодНачисленияАмортизации,
	               |	0 КАК КоличествоВыпущеннойПродукции,
	               |	СведенияОС.ДатаПринятияКУчету КАК ДатаПринятияКУчету,
	               |	СведенияОС.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	               |	СведенияОС.СчетУчета КАК СчетУчета,
	               |	СведенияОС.СчетЗатрат КАК СчетЗатрат,
	               |	СведенияОС.СчетНачисленияАмортизации КАК СчетНачисленияАмортизации,
	               |	СведенияОС.СчетСниженияСтоимости КАК СчетСниженияСтоимости,
	               |	СведенияОС.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
	               |	СведенияОС.КоэффициентУскорения КАК КоэффициентУскорения,
	               |	СведенияОС.ПредполагаемыйОбъемПродукции КАК ПредполагаемыйОбъемПродукции,
	               |	СведенияОС.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	               |	СведенияОС.СправедливаяСтоимость КАК СправедливаяСтоимость,
	               |	СведенияОС.МестонахождениеОбъекта КАК МестонахождениеОбъекта,
	               |	СведенияОС.МОЛ КАК МОЛ,
	               |	СведенияОС.НачислятьАмортизацию КАК НачислятьАмортизацию,
	               |	СведенияОС.СуммаНачисленнойАмортизации КАК СуммаНачисленнойАмортизации,
	               |	СведенияОС.Состояние КАК Состояние,
	               |	СведенияОС.Субконто1 КАК Субконто1,
	               |	СведенияОС.Субконто2 КАК Субконто2,
	               |	СведенияОС.Субконто3 КАК Субконто3,
	               |	УчетнаяПолитика.МетодОценкиОсновныхСредств КАК МетодОценкиОсновныхСредств,
	               |	СписокОС.НомерСтроки
	               |ИЗ
	               |	Документ.ПоступлениеОсновныхСредствМеждународный.ОсновныеСредства КАК СписокОС
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПоследних(
	               |		&Дата,
	               |		ОсновноеСредство В
	               |		    (ВЫБРАТЬ
	               |		        Документ.ПоступлениеОсновныхСредствМеждународный.ОсновныеСредства.ОсновноеСредство
	               |		    ИЗ
	               |		        Документ.ПоступлениеОсновныхСредствМеждународный.ОсновныеСредства
	               |		    ГДЕ
	               |		        Документ.ПоступлениеОсновныхСредствМеждународный.ОсновныеСредства.Ссылка = &Ссылка)) КАК СведенияОС
	               |		ПО СведенияОС.ОсновноеСредство = СписокОС.ОсновноеСредство
	               |			И (СведенияОС.НачислятьАмортизацию)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаМеждународныйУчет.СрезПоследних(&Дата, Организация = &Организация) КАК УчетнаяПолитика
	               |		ПО (ИСТИНА)
	               |ГДЕ
	               |	СписокОС.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
	Запрос.УстановитьПараметр("Дата", Новый Граница(КонецМесяца(Документ.Дата),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", Документ.Организация);
	ВыборкаОС = Запрос.Выполнить().Выбрать();
	
	
	
	Пока ВыборкаОС.Следующий() Цикл
		ДатаУстановки = НачалоМесяца(ВыборкаОС.ДатаПринятияКУчету);
		Сумма = 0;
		СчетУчета = ВыборкаОС.СчетУчета;
		СчетЗатрат = ВыборкаОС.СчетЗатрат;
		СчетНачисленияАмортизации = ВыборкаОС.СчетНачисленияАмортизации;
		СчетСниженияСтоимости = ВыборкаОС.СчетСниженияСтоимости;

		ОставшеесяЧислоМесяцев = ВыборкаОС.СрокПолезногоИспользования - Окр((НачалоМесяца(КонецМесяца(Документ.Дата)+1)-ДатаУстановки)/60/60/24/30,0);
		Если ОставшеесяЧислоМесяцев>=0 Тогда			
			продолжить;
		КонецЕсли;
		МассивСчетов = Новый Массив();
		МассивСчетов.Добавить(ВыборкаОС.СчетУчета);
		МассивСчетов.Добавить(ВыборкаОС.СчетНачисленияАмортизации);
		МассивСчетов.Добавить(ВыборкаОС.СчетСниженияСтоимости);
		БухИтоги = Обработки.БухгалтерскиеИтоги.Создать();
		БухИтоги.РассчитатьИтоги("Международный", "КонечныйОстатокДт,КонечныйОстатокКт", "Сумма", "Счет,Субконто1", КонецМесяца(Документ.Дата), КонецМесяца(Документ.Дата), , МассивСчетов, ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства, , ,"Организация", Документ.Организация);
		НакопленнаяАмортизация = БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокКт", "Счет,Субконто1", СчетНачисленияАмортизации, ВыборкаОС.ОсновноеСредство);
		ОстаточнаяСтоимость = БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокДт", "Счет,Субконто1", СчетУчета, ВыборкаОС.ОсновноеСредство)-
					НакопленнаяАмортизация -
					БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокКт", "Счет,Субконто1", СчетСниженияСтоимости, ВыборкаОС.ОсновноеСредство);
					Если НакопленнаяАмортизация = 0 Тогда
						продолжить;
					КонецЕсли;	
		Коэффициент = ОстаточнаяСтоимость / НакопленнаяАмортизация;			
		СтрокаДокумента = Документ.ОсновныеСредства[ВыборкаОС.НомерСтроки-1];
		НовыйСрок = СтрокаДокумента.СрокПолезногоИспользования+Окр(СтрокаДокумента.СрокПолезногоИспользования*Коэффициент+0.5,0);
		НовыйСрок = НовыйСрок - ОставшеесяЧислоМесяцев;
		сообщить("В строке № "+ВыборкаОС.НомерСтроки+" срок полезного использования изменен с "+СтрокаДокумента.СрокПолезногоИспользования+" на "+НовыйСрок);
		СтрокаДокумента.СрокПолезногоИспользования = НовыйСрок;
		
	КонецЦикла;	
			

КонецПроцедуры	

//Процедура ОбработкаВсехОсновныхСредств() Экспорт
//	Счета = ПланыСчетов.Международный;
//		
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//				   |	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
//				   |	СписокОС.МетодНачисленияАмортизации КАК МетодНачисленияАмортизации,
//				   |	0 КАК КоличествоВыпущеннойПродукции,
//				   |	СведенияОС.ДатаПринятияКУчету КАК ДатаПринятияКУчету,
//				   |	СведенияОС.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
//				   |	СведенияОС.СчетУчета КАК СчетУчета,
//				   |	СведенияОС.СчетЗатрат КАК СчетЗатрат,
//				   |	СведенияОС.СчетНачисленияАмортизации КАК СчетНачисленияАмортизации,
//				   |	СведенияОС.СчетСниженияСтоимости КАК СчетСниженияСтоимости,
//				   |	СведенияОС.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
//				   |	СведенияОС.КоэффициентУскорения КАК КоэффициентУскорения,
//				   |	СведенияОС.ПредполагаемыйОбъемПродукции КАК ПредполагаемыйОбъемПродукции,
//				   |	СведенияОС.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
//				   |	СведенияОС.СправедливаяСтоимость КАК СправедливаяСтоимость,
//				   |	СведенияОС.МестонахождениеОбъекта КАК МестонахождениеОбъекта,
//				   |	СведенияОС.МОЛ КАК МОЛ,
//				   |	СведенияОС.НачислятьАмортизацию КАК НачислятьАмортизацию,
//				   |	СведенияОС.СуммаНачисленнойАмортизации КАК СуммаНачисленнойАмортизации,
//				   |	СведенияОС.Состояние КАК Состояние,
//				   |	СведенияОС.Субконто1 КАК Субконто1,
//				   |	СведенияОС.Субконто2 КАК Субконто2,
//				   |	СведенияОС.Субконто3 КАК Субконто3,
//				   |	УчетнаяПолитика.МетодОценкиОсновныхСредств КАК МетодОценкиОсновныхСредств,
//				   |	СписокОС.НомерСтроки
//				   |ИЗ
//				   |	Документ.ПоступлениеОсновныхСредствМеждународный.ОсновныеСредства КАК СписокОС
//				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПоследних(
//				   |		&Дата,
//				   |		ОсновноеСредство В
//				   |		    (ВЫБРАТЬ
//				   |		        Документ.ПоступлениеОсновныхСредствМеждународный.ОсновныеСредства.ОсновноеСредство
//				   |		    ИЗ
//				   |		        Документ.ПоступлениеОсновныхСредствМеждународный.ОсновныеСредства
//				   |		    ГДЕ
//				   |		        Документ.ПоступлениеОсновныхСредствМеждународный.ОсновныеСредства.Ссылка = &Ссылка)) КАК СведенияОС
//				   |		ПО СведенияОС.ОсновноеСредство = СписокОС.ОсновноеСредство
//				   |			И (СведенияОС.НачислятьАмортизацию)
//				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаМеждународныйУчет.СрезПоследних(&Дата, Организация = &Организация) КАК УчетнаяПолитика
//				   |		ПО (ИСТИНА)
//				   |ГДЕ
//				   |	СписокОС.Ссылка = &Ссылка";
//	
//	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
//	Запрос.УстановитьПараметр("Дата", Новый Граница(КонецМесяца(Документ.Дата),ВидГраницы.Включая));
//	Запрос.УстановитьПараметр("Организация", Документ.Организация);
//	ВыборкаОС = Запрос.Выполнить().Выбрать();
//	
//	
//КонецПроцедуры
